# Working with pandas:

In [1]:
import numpy as np
people={
    "Muskan":np.random.randint(1,100,5), #provides 5 random integral values between the range 1-100(specified)
    "Mary":np.random.randint(50,100,5),
    "Harry":np.random.randint(45,150,5)
}
people

{'Muskan': array([39, 98, 36, 19, 98]),
 'Mary': array([57, 85, 63, 90, 52]),
 'Harry': array([121,  54,  56, 102,  97])}

In [2]:
import pandas as pd #pd is alias of pandas

## Printing the content of people in Tabular form using Dataframes.

In [3]:
df=pd.DataFrame(people)  #keep in mind, there are 5 integers each in Muskan, Mary and Harry, if the count varies i.e, 5 in Muskan, 6 in Mary and 8 in Harry then this command will show an error. You can try it for yourself.
df

   Muskan  Mary  Harry
0      39    57    121
1      98    85     54
2      36    63     56
3      19    90    102
4      98    52     97

In [4]:
df.head(2) #if you want to see some specific amunt of rows, then use .head(n)

   Muskan  Mary  Harry
0      39    57    121
1      98    85     54

In [5]:
df.columns

Index(['Muskan', 'Mary', 'Harry'], dtype='object')

## Learn how to create a CSV (Comma Separated Values) file:

In [6]:
df.to_csv('people.csv')

In [7]:
##reading dataframe:
df=pd.read_csv('people.csv')
df

   Unnamed: 0  Muskan  Mary  Harry
0           0      39    57    121
1           1      98    85     54
2           2      36    63     56
3           3      19    90    102
4           4      98    52     97

In [8]:
## Dropping a particular column /indexes
df.drop?

In [9]:
df.drop(columns=['Unnamed: 0'],index=1)

   Muskan  Mary  Harry
0      39    57    121
2      36    63     56
3      19    90    102
4      98    52     97

In [10]:
df.shape

(5, 4)

Thank you